app/controllers/clients/omniauth_callbacks_controller.rb

SELECT  1 AS one FROM "clients" WHERE "clients"."email" = ? LIMIT ?  [["email", "sergioalexander86@gmail.com"], ["LIMIT", 1]]
---
  def twitter
    @client = Client.from_omniauth(request.env["omniauth.auth"])
    if @client.persisted?
      sign_in @client,event: :authentication
      redirect_to edit_client_registration_path, :event => :authentication #this will throw if @user is not activated
      set_flash_message(:notice, :success, :kind => "Twitter") if is_navigational_format?
    else
      session["devise.twitter_data"] = request.env["omniauth.auth"].except("extra")
      puts @client.errors
      if Client.exists?(email: @client.email)