app/views/dishes/_form.html.erb

SELECT "specialities".* FROM "specialities"
---
    <%= form.label :speciality %>
    <%= form.select :speciality_id, options_for_select(Speciality.all.map{|s|[s.name, s.id]}, params[:speciality_id]) %>