app/controllers/comments_controller.rb

  def create
    @comment = current_client.comments.new(comment_params)
    @comment.dish = @dish

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("client_id", "dish_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["client_id", 5], ["dish_id", 1], ["body", "holines"], ["created_at", "2017-10-04 18:24:32.244421"], ["updated_at", "2017-10-04 18:24:32.244421"]]

    def set_dish
      @dish = Dish.find(params[:dish_id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]