app/controllers/dishes_controller.rb

  def new
    @dish = Dish.new
    @specialities = Speciality.all
---
SELECT "specialities".* FROM "specialities"

  def edit
    @specialities = Speciality.all
---
SELECT "specialities".* FROM "specialities"

  def create
    @dish = Dish.new(dish_params)

    respond_to do |format|
      if @dish.save
---
INSERT INTO "dishes" ("name", "state", "description", "created_at", "updated_at", "speciality_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["state", "Disponible"], ["description", ""], ["created_at", "2017-09-28 19:35:33.719470"], ["updated_at", "2017-09-28 19:35:33.719470"], ["speciality_id", 1]]

  def update
    respond_to do |format|
      if @dish.update(dish_params)
---
UPDATE "dishes" SET "photo_file_name" = ?, "photo_file_size" = ?, "photo_updated_at" = ?, "updated_at" = ? WHERE "dishes"."id" = ?  [["photo_file_name", "images.jpg"], ["photo_file_size", 11758], ["photo_updated_at", "2017-09-28 04:36:18.918764"], ["updated_at", "2017-09-28 04:36:19.715593"], ["id", 1]]

  def destroy
    @dish.destroy
---
DELETE FROM "dishes" WHERE "dishes"."id" = ?  [["id", 2]]

    def set_dish
      @dish = Dish.find(params[:id])

      @comments = @dish.comments.paginate(:page => params[:page],:per_page => 5)
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."dish_id" = ? LIMIT ? OFFSET ?  [["dish_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."dish_id" = ?  [["dish_id", 1]]