app/controllers/menu_controller.rb

  def menu
    @specialities = Speciality.all
---
SELECT "specialities".* FROM "specialities"