app/controllers/orders_controller.rb

  def show
    @param = params[:id]
    @orderdishes = @order.orderdishes.joins(:dish).select("orderdishes.*, orderdishes.state as orderstate, dishes.*")
---
SELECT orderdishes.*, orderdishes.state as orderstate, dishes.*, dishes.photo as pho FROM "orderdishes" INNER JOIN "dishes" ON "dishes"."id" = "orderdishes"."dish_id" WHERE "orderdishes"."order_id" = ?  [["order_id", 16]]

  def new
    @order = Order.new
    @specialities = Speciality.all
---
SELECT "specialities".* FROM "specialities"

  def create
    @order = current_client.orders.new
    #raise @order.to_yaml
    orderdishes = params[:orderdishes]
    total_price = 0
    orderdishes.each do |key, value|
      if not orderdishes[key]["id"].eql?(nil) and orderdishes[key]["quantity"].to_i>0
        plate_id = orderdishes[key]["id"]
        quantity = orderdishes[key]["quantity"].to_i
        price = Dish.find(plate_id).price
        total_price += quantity*price
      end
    end
    @order.price = total_price
    @order.state = "On hold"
    @order.table_id = 1
    @order.save
    orderdishes.each do |key, value|
      if not orderdishes[key]["id"].eql?(nil) and orderdishes[key]["quantity"].to_i>0
        plate_id = orderdishes[key]["id"]
        quantity = orderdishes[key]["quantity"].to_i
        specification = orderdishes[key]["specification"]
        #Orderdish.create("On hold", quantity, specification, Order.last.id, plate_id)
        orderdish = Orderdish.new
        orderdish.state = "On hold"
        orderdish.quantity = quantity
        orderdish.specification = specification
        orderdish.order_id = current_client.orders.last.id
        orderdish.dish_id = plate_id
        orderdish.save
---
SELECT  "orders".* FROM "orders" WHERE "orders"."client_id" = ? ORDER BY "orders"."id" DESC LIMIT ?  [["client_id", 5], ["LIMIT", 1]]
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("price", "state", "created_at", "updated_at", "table_id", "client_id") VALUES (?, ?, ?, ?, ?, ?)  [["price", 330], ["state", "On hold"], ["created_at", "2017-10-09 01:56:59.726756"], ["updated_at", "2017-10-09 01:56:59.726756"], ["table_id", 1], ["client_id", 5]]
INSERT INTO "orderdishes" ("state", "quantity", "specification", "created_at", "updated_at", "order_id", "dish_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["state", "On hold"], ["quantity", 1], ["specification", "holis"], ["created_at", "2017-10-09 02:15:38.617743"], ["updated_at", "2017-10-09 02:15:38.617743"], ["order_id", 8], ["dish_id", 1]]