app/controllers/order_views_controller.rb

  def currentOrderClient
   @currentorder = Order.joins(:table, :orderdishes, :dishes).find(current_client.orders.last.id)
---
SELECT  "orders".* FROM "orders" INNER JOIN "tables" ON "tables"."id" = "orders"."table_id" INNER JOIN "orderdishes" ON "orderdishes"."order_id" = "orders"."id" INNER JOIN "orderdishes" "orderdishes_orders_join" ON "orderdishes_orders_join"."order_id" = "orders"."id" INNER JOIN "dishes" ON "dishes"."id" = "orderdishes_orders_join"."dish_id" WHERE "orders"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]