app/controllers/tables_controller.rb

  def index
    @tables = Table.all
---
SELECT "tables".* FROM "tables"

  def show
    @table = Table.find(params[:id])
---
SELECT  "tables".* FROM "tables" WHERE "tables"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
    @table = Table.new
    @waiters = Waiter.all
---
SELECT "waiters".* FROM "waiters"

  def create
    @table = Table.new(table_params)

    respond_to do |format|
      if @table.save
---
INSERT INTO "tables" ("number", "sector", "created_at", "updated_at", "waiter_id") VALUES (?, ?, ?, ?, ?)  [["number", 1], ["sector", "entrada"], ["created_at", "2017-10-09 01:41:17.609172"], ["updated_at", "2017-10-09 01:41:17.609172"], ["waiter_id", 1]]